In [87]:
import pandas as pd
import numpy as np

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [88]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [89]:
#Name of persons 2-4
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [90]:
#Name and AGe from Persons 2-4
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [91]:
#First Two Rows
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [92]:
#Last Two Rows
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [93]:
#First Column without specifying name of column
df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [94]:
#df.loc[:,['age', 'state']] = df[['age', 'state']]

In [95]:
#people whose age is greater than 30
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [96]:
#finding all info of a person by index
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [97]:
#my attempt
df[[df.age > 40] & [df.num_pets > 0]]

TypeError: unsupported operand type(s) for &: 'list' and 'list'

In [98]:
#over 40 and has pets
agePets = df[ (df['age'] > 40) & (df['num_pets'] > 0)]

In [99]:
print(agePets)
len(agePets)

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

1

In [100]:
len (df)

6

In [101]:
#Is over 40 and/or has pets
df[ (df['age'] > 40) | (df['num_pets'] > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [102]:
#Either over 40 or has pets
df[ (df['age'] > 40) != (df['num_pets'] > 0)]

   name  age       state  num_children  num_pets
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [103]:
#to remove a column from a copy of a read out
df.drop(["age",'num_children'],axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [104]:
print(df) #overwritting the value of df with df.drop with overwrite for entire file

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [105]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [106]:
df[["age","num_pets","num_children"]].mean()

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [107]:
df[["age","num_pets","num_children"]].apply(lambda col: np.sum(col),axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [108]:
df[["age","num_pets","num_children"]].sum()

age             220
num_pets          9
num_children      8
dtype: int64

In [109]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

In [118]:
#average age of female in titanic
df2 = pd.read_csv('titanic.csv')

femaleAge=df2[df2['Sex'] == 'female']

femaleAge[['Age']].mean()

Age    27.915709
dtype: float64

In [121]:
df2[df2['Sex'] == 'female']['Age'].mean()

27.915708812260537

In [122]:
df2['Age'].mean()

29.69911764705882

In [123]:
df2[df2['Sex'] == 'male']['Age'].mean()

30.72664459161148

In [124]:
print(df2)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [127]:
ls_sex = df2['Sex'].values
ls_age = df2['Age'].values

In [147]:
def female_avg_age(sex, age):
    total_age = 0
    count = 0
    for (i,j) in zip(sex,age):
        if (i in ['female']) & (np.isnan(j) in [False]): #("in []) == (==) 
            total_age += j
            count += 1
            
    return (total_age/count)

female_avg_age(ls_sex, ls_age)

27.915708812260537

In [151]:
df[['age']] #Pandas Dataframe

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [150]:
df['age'] #Pandas Series

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64